Revit 2024 API
BuiltInFailures.SketchFailures.TooManySlopes Property
 There is more than one slope defined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TooManySlopes { get; }
Visual Basic
Public Shared ReadOnly Property TooManySlopes As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TooManySlopes {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace